package com.ruijie.rcos.rcdc.rco.module.def.api.enums;

/**
 * Description: 密码复杂度正则
 * Copyright: Copyright (c) 2018
 * Company: Ruijie Co., Ltd.
 * Create Time: 2019年7月24日
 *
 * @author zhang.zhiwen
 */
public enum CertificationStrategyRegexEnum {

    /**
     * 普通，长度6-32，没有字符校验
     */
    PATTERN_ONE("^[a-zA-Z0-9`~!@#$%^&*()_\\-+=<>?:\"{}|,./\\\\;'\\[\\]\\s]{6,32}$"),
    /**
     * 中等，长度8-32，需要大写字母、小写字母、数字、特殊字符四种中的三种
     */
    PATTERN_TWO("^(?![a-zA-Z]+$)(?![A-Z0-9]+$)(?![A-Z`~!@#$%^&*()_\\-+=<>?:\"{}|,./\\\\;'\\[\\]\\s]+$)(?![a-z0-9]+$)" +
            "(?![a-z`~!@#$%^&*()_\\-+=<>?:\"{}|,./\\\\;'\\[\\]\\s]+$)(?![0-9`~!@#$%^&*()_\\-+=<>?:\"{}|,./\\\\;'\\[\\]\\s]+$)" +
            "[a-zA-Z0-9`~!@#$%^&*()_\\-+=<>?:\"{}|,./\\\\;'\\[\\]\\s]{8,32}$"),
    /**
     * 复杂，长度8-32，需要大写字母、小写字母、数字、特殊字符四种
     */
    PATTERN_THREE("^(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])(?=.*[`~!@#$%^&*()_\\-+=<>?:\"{}|,./;'\\\\\\[\\]\\s])" +
            "[a-zA-Z0-9`~!@#$%^&*()_\\-+=<>?:\"{}|,./;'\\\\\\[\\]\\s]{8,32}$"),
    /**
     * 原默认密码长度，长度8-32，需要大写字母、小写字母、数字、特殊字符四种中的三种
     */
    PATTERN_DEFAULT("^(?![a-zA-Z]+$)(?![A-Z0-9]+$)(?![A-Z`~!@#$%^&*()_\\-+=<>?:\"{}|,./\\\\;'\\[\\]\\s]+$)(?![a-z0-9]+$)" +
            "(?![a-z`~!@#$%^&*()_\\-+=<>?:\"{}|,./\\\\;'\\[\\]\\s]+$)(?![0-9`~!@#$%^&*()_\\-+=<>?:\"{}|,./\\\\;'\\[\\]\\s]+$)" +
            "[a-zA-Z0-9`~!@#$%^&*()_\\-+=<>?:\"{}|,./\\\\;'\\[\\]\\s]{8,32}$");

    private String pattern;

    CertificationStrategyRegexEnum(String pattern) {
        this.pattern = pattern;
    }

    public String getPattern() {
        return pattern;
    }
}
